<template>
  <div class="footer">
    <img src="/image/svg/line-up-footer.svg" alt="фон" />
    <div class="footer-block d-flex justify-content-center align-items-center">
      <div class="wraper d-inline-flex justify-content-between">
        <div class="d-flex flex-column justify-content-around">
          <ul class="list-item">
            <li class="list-link">
              <router-link class="link-item" to="/about">О нас</router-link>
            </li>
            <li class="list-link">
              <router-link class="link-item" to="/news-action"
                >Новости и акции</router-link
              >
            </li>
            <li class="list-link">
              <router-link class="link-item" to="/map"
                >Как добраться</router-link
              >
            </li>
            <li class="list-link">
              <router-link class="link-item" to="/partner"
                >Партнерам</router-link
              >
            </li>
          </ul>
          <p class="text-magazin">nikolsky mall, 2021</p>
        </div>
        <div
          class="footer-block-right d-flex flex-column justify-content-around"
        >
          <ul class="list-item">
            <li>
              <router-link class="link-map" to="/map">
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M12 23.7279L5.636 17.3639C4.37734 16.1052 3.52019 14.5016 3.17293 12.7558C2.82567 11.0099 3.00391 9.20035 3.6851 7.55582C4.36629 5.91129 5.51984 4.50569 6.99988 3.51677C8.47992 2.52784 10.22 2 12 2C13.78 2 15.5201 2.52784 17.0001 3.51677C18.4802 4.50569 19.6337 5.91129 20.3149 7.55582C20.9961 9.20035 21.1743 11.0099 20.8271 12.7558C20.4798 14.5016 19.6227 16.1052 18.364 17.3639L12 23.7279ZM16.95 15.9499C17.9289 14.9709 18.5955 13.7236 18.8656 12.3658C19.1356 11.0079 18.9969 9.60052 18.4671 8.32148C17.9373 7.04244 17.04 5.94923 15.8889 5.18009C14.7378 4.41095 13.3844 4.00043 12 4.00043C10.6156 4.00043 9.26222 4.41095 8.11109 5.18009C6.95996 5.94923 6.06275 7.04244 5.53292 8.32148C5.00308 9.60052 4.86442 11.0079 5.13445 12.3658C5.40449 13.7236 6.07111 14.9709 7.05 15.9499L12 20.8999L16.95 15.9499V15.9499ZM12 12.9999C11.4696 12.9999 10.9609 12.7892 10.5858 12.4141C10.2107 12.0391 10 11.5304 10 10.9999C10 10.4695 10.2107 9.96078 10.5858 9.58571C10.9609 9.21064 11.4696 8.99992 12 8.99992C12.5304 8.99992 13.0391 9.21064 13.4142 9.58571C13.7893 9.96078 14 10.4695 14 10.9999C14 11.5304 13.7893 12.0391 13.4142 12.4141C13.0391 12.7892 12.5304 12.9999 12 12.9999Z"
                    fill="white"
                  />
                </svg>
                <span class="contact-style"
                  >Екатеринбург, ул. Мамина-Сибиряка, д. 34</span
                >
              </router-link>
            </li>
            <li>
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M12 22C6.477 22 2 17.523 2 12C2 6.477 6.477 2 12 2C17.523 2 22 6.477 22 12C22 17.523 17.523 22 12 22ZM12 20C14.1217 20 16.1566 19.1571 17.6569 17.6569C19.1571 16.1566 20 14.1217 20 12C20 9.87827 19.1571 7.84344 17.6569 6.34315C16.1566 4.84285 14.1217 4 12 4C9.87827 4 7.84344 4.84285 6.34315 6.34315C4.84285 7.84344 4 9.87827 4 12C4 14.1217 4.84285 16.1566 6.34315 17.6569C7.84344 19.1571 9.87827 20 12 20V20ZM13 12H17V14H11V7H13V12Z"
                  fill="white"
                />
              </svg>
              <span class="time" to="/news-action">
                Магазины и рестораны: 10.00 - 22.00
              </span>
            </li>
            <li>
              <p class="sinima">Кинотеатр: 8.00 - 1.00</p>
            </li>
            <li>
              <ul class="contact d-inline-flex">
                <li>
                  <a class="phone" href="tel:+73435375999">
                    <svg
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        fill-rule="evenodd"
                        clip-rule="evenodd"
                        d="M9.207 14.7931C11.525 17.1111 13.678 18.4031 15.28 19.1211C16.679 19.7481 18.33 19.2561 19.617 17.9691L19.911 17.6741L16.375 15.4241C15.703 16.4041 14.432 16.9791 13.163 16.4441C12.202 16.0381 10.93 15.3441 9.793 14.2071C8.656 13.0701 7.963 11.7981 7.557 10.8371C7.021 9.56814 7.595 8.29714 8.576 7.62514L6.326 4.08914L6.031 4.38314C4.744 5.67014 4.253 7.32114 4.879 8.72014C5.597 10.3221 6.889 12.4751 9.207 14.7931ZM14.463 20.9461C12.648 20.1331 10.291 18.7051 7.793 16.2071C5.295 13.7101 3.867 11.3521 3.053 9.53714C1.978 7.13714 2.96 4.62714 4.617 2.96914L4.911 2.67414C5.12275 2.46226 5.37938 2.30064 5.66195 2.20124C5.94453 2.10183 6.24582 2.06716 6.54359 2.0998C6.84135 2.13243 7.12799 2.23154 7.38232 2.3898C7.63665 2.54806 7.85218 2.76142 8.013 3.01414L10.843 7.46414C10.918 7.58218 10.9673 7.71463 10.9879 7.85293C11.0085 7.99124 10.9999 8.13232 10.9626 8.26708C10.9252 8.40183 10.8601 8.52727 10.7713 8.63528C10.6825 8.74329 10.572 8.83147 10.447 8.89414L9.814 9.21114C9.382 9.42714 9.294 9.80814 9.399 10.0591C9.738 10.8621 10.305 11.8901 11.207 12.7931C12.11 13.6951 13.138 14.2621 13.941 14.6011C14.192 14.7071 14.573 14.6181 14.789 14.1861L15.106 13.5531C15.1686 13.4281 15.2567 13.3175 15.3647 13.2286C15.4726 13.1397 15.5981 13.0744 15.7328 13.037C15.8676 12.9996 16.0087 12.9909 16.147 13.0114C16.2854 13.0319 16.4179 13.0812 16.536 13.1561L20.986 15.9871C21.2387 16.148 21.4521 16.3635 21.6103 16.6178C21.7686 16.8722 21.8677 17.1588 21.9003 17.4566C21.933 17.7543 21.8983 18.0556 21.7989 18.3382C21.6995 18.6208 21.5379 18.8774 21.326 19.0891L21.031 19.3831C19.374 21.0411 16.864 22.0221 14.463 20.9461Z"
                        fill="white"
                      />
                    </svg>
                    <span class="contact-style">+7 343 537-59-99</span>
                  </a>
                </li>
                <li>
                  <a class="mail" href="mailto:info@nikolskymall.ru">
                    <svg
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M3 3H21C21.2652 3 21.5196 3.10536 21.7071 3.29289C21.8946 3.48043 22 3.73478 22 4V20C22 20.2652 21.8946 20.5196 21.7071 20.7071C21.5196 20.8946 21.2652 21 21 21H3C2.73478 21 2.48043 20.8946 2.29289 20.7071C2.10536 20.5196 2 20.2652 2 20V4C2 3.73478 2.10536 3.48043 2.29289 3.29289C2.48043 3.10536 2.73478 3 3 3V3ZM20 7.238L12.072 14.338L4 7.216V19H20V7.238ZM4.511 5L12.061 11.662L19.502 5H4.511Z"
                        fill="white"
                      />
                    </svg>
                    <span class="contact-style">info@nikolskymall.ru</span>
                  </a>
                </li>
              </ul>
            </li>
            <li>
              <ul class="contact-subscribe d-inline-flex">
                <li>
                  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M3.741 1.40811L22.203 11.5621C22.2814 11.6053 22.3468 11.6687 22.3923 11.7457C22.4378 11.8228 22.4618 11.9106 22.4618 12.0001C22.4618 12.0896 22.4378 12.1774 22.3923 12.2545C22.3468 12.3315 22.2814 12.3949 22.203 12.4381L3.741 22.5921C3.66487 22.634 3.57915 22.6553 3.49227 22.654C3.4054 22.6526 3.32037 22.6287 3.24558 22.5844C3.17078 22.5402 3.1088 22.4773 3.06573 22.4018C3.02267 22.3264 3.00001 22.241 3 22.1541V1.84611C3.00001 1.75922 3.02267 1.67384 3.06573 1.59838C3.1088 1.52291 3.17078 1.45997 3.24558 1.41576C3.32037 1.37155 3.4054 1.34759 3.49227 1.34625C3.57915 1.34491 3.66487 1.36623 3.741 1.40811V1.40811ZM5 13.0001V19.6171L18.85 12.0001L5 4.38311V11.0001H10V13.0001H5Z"
                      fill="white"
                    />
                  </svg>
                  <span class="subscribe">Подписывайтесь</span>
                </li>
                <li>
                  <a class="social" href="#">
                    <svg
                      width="22"
                      height="22"
                      viewBox="0 0 22 22"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M21.9983 10.9992C21.9983 4.92448 17.0738 0 10.9992 0C4.92448 0 0 4.92448 0 10.9992C0 16.4892 4.02223 21.0395 9.28052 21.8647V14.1786H6.48778V10.9992H9.28052V8.5759C9.28052 5.81924 10.9226 4.29655 13.435 4.29655C14.6384 4.29655 15.8972 4.51137 15.8972 4.51137V7.21819H14.5103C13.1439 7.21819 12.7177 8.06605 12.7177 8.93589V10.9992H15.7683L15.2807 14.1786H12.7177V21.8647C17.9761 21.0395 21.9983 16.4892 21.9983 10.9992Z"
                        fill="white"
                      />
                    </svg>
                    <span class="visually-hidden">Facebook</span>
                  </a>
                </li>
                <li>
                  <a class="social" href="#">
                    <svg
                      width="22"
                      height="22"
                      viewBox="0 0 22 22"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M11 0C8.01167 0 7.63858 0.01375 6.46525 0.066C5.29375 0.121 4.49625 0.30525 3.795 0.5775C3.07175 0.858 2.45758 1.23475 1.84617 1.84617C1.23475 2.45758 0.857083 3.07083 0.5775 3.795C0.30525 4.49625 0.120083 5.29375 0.066 6.46525C0.011 7.63858 0 8.01167 0 11C0 13.9883 0.01375 14.3614 0.066 15.5348C0.121 16.7053 0.30525 17.5038 0.5775 18.205C0.858 18.9273 1.23475 19.5424 1.84617 20.1538C2.45758 20.7643 3.07083 21.1429 3.795 21.4225C4.49717 21.6938 5.29467 21.8799 6.46525 21.934C7.63858 21.989 8.01167 22 11 22C13.9883 22 14.3614 21.9862 15.5348 21.934C16.7053 21.879 17.5038 21.6938 18.205 21.4225C18.9273 21.142 19.5424 20.7643 20.1538 20.1538C20.7643 19.5424 21.1429 18.9301 21.4225 18.205C21.6938 17.5038 21.8799 16.7053 21.934 15.5348C21.989 14.3614 22 13.9883 22 11C22 8.01167 21.9862 7.63858 21.934 6.46525C21.879 5.29467 21.6938 4.49533 21.4225 3.795C21.142 3.07175 20.7643 2.45758 20.1538 1.84617C19.5424 1.23475 18.9301 0.857083 18.205 0.5775C17.5038 0.30525 16.7053 0.120083 15.5348 0.066C14.3614 0.011 13.9883 0 11 0ZM11 1.98C13.9361 1.98 14.2863 1.99467 15.4458 2.04508C16.5183 2.0955 17.1004 2.27333 17.4872 2.4255C18.0024 2.62442 18.3673 2.86275 18.7541 3.24683C19.1382 3.63183 19.3765 3.99758 19.5754 4.51275C19.7257 4.89958 19.9054 5.48167 19.954 6.55417C20.0063 7.71467 20.0182 8.063 20.0182 11C20.0182 13.937 20.0044 14.2863 19.9503 15.4458C19.8944 16.5183 19.7157 17.1004 19.5644 17.4872C19.3591 18.0024 19.1253 18.3673 18.7403 18.7541C18.3563 19.1382 17.985 19.3765 17.4753 19.5754C17.0903 19.7257 16.4991 19.9054 15.4266 19.954C14.2588 20.0063 13.915 20.0182 10.9725 20.0182C8.02908 20.0182 7.68533 20.0044 6.51842 19.9503C5.445 19.8944 4.85375 19.7157 4.46875 19.5644C3.94717 19.3591 3.58875 19.1253 3.20467 18.7403C2.81875 18.3563 2.57217 17.985 2.37967 17.4753C2.22842 17.0903 2.05058 16.4991 1.99467 15.4266C1.95342 14.2716 1.93875 13.915 1.93875 10.9862C1.93875 8.05658 1.95342 7.69908 1.99467 6.53033C2.05058 5.45783 2.22842 4.8675 2.37967 4.4825C2.57217 3.96 2.81875 3.6025 3.20467 3.21658C3.58875 2.8325 3.94717 2.585 4.46875 2.39342C4.85375 2.24125 5.43217 2.0625 6.50467 2.0075C7.67342 1.96625 8.01717 1.9525 10.9587 1.9525L11 1.98ZM11 5.3515C7.87875 5.3515 5.3515 7.8815 5.3515 11C5.3515 14.1213 7.8815 16.6485 11 16.6485C14.1213 16.6485 16.6485 14.1185 16.6485 11C16.6485 7.87875 14.1185 5.3515 11 5.3515ZM11 14.6667C8.97417 14.6667 7.33333 13.0258 7.33333 11C7.33333 8.97417 8.97417 7.33333 11 7.33333C13.0258 7.33333 14.6667 8.97417 14.6667 11C14.6667 13.0258 13.0258 14.6667 11 14.6667ZM18.1922 5.12875C18.1922 5.8575 17.6 6.44875 16.8722 6.44875C16.1434 6.44875 15.5522 5.85658 15.5522 5.12875C15.5522 4.40092 16.1443 3.80967 16.8722 3.80967C17.5991 3.80875 18.1922 4.40092 18.1922 5.12875Z"
                        fill="white"
                      />
                    </svg>
                    <span class="visually-hidden">Instagram</span>
                  </a>
                </li>
                <li>
                  <a class="social" href="#">
                    <svg
                      width="22"
                      height="22"
                      viewBox="0 0 22 22"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M14.377 0H7.623C1.45933 0 0 1.45933 0 7.623V14.377C0 20.5407 1.45933 22 7.623 22H14.377C20.5407 22 22 20.5407 22 14.377V7.623C22 1.45933 20.5251 0 14.377 0ZM17.7613 15.6961H16.1627C15.5577 15.6961 15.3707 15.2148 14.2835 14.113C13.3366 13.1963 12.9177 13.0726 12.6848 13.0726C12.3585 13.0726 12.265 13.1661 12.265 13.6162V15.0599C12.265 15.4486 12.1413 15.6814 11.1164 15.6814C9.42425 15.6814 7.54508 14.6566 6.226 12.7463C4.23867 9.95225 3.69417 7.85583 3.69417 7.42133C3.69417 7.1885 3.78767 6.97125 4.23775 6.97125H5.83642C6.23975 6.97125 6.39558 7.15733 6.55142 7.59183C7.3425 9.87433 8.6625 11.8772 9.20608 11.8772C9.40775 11.8772 9.50125 11.7838 9.50125 11.2723V8.91092C9.43892 7.82375 8.86417 7.73117 8.86417 7.34342C8.86417 7.15642 9.02 6.97033 9.2675 6.97033H11.7828C12.1248 6.97033 12.2485 7.15642 12.2485 7.55975V10.7433C12.2485 11.0843 12.4043 11.209 12.4969 11.209C12.6986 11.209 12.87 11.0843 13.2422 10.7122C14.3917 9.42333 15.2139 7.436 15.2139 7.436C15.323 7.20317 15.5091 6.98592 15.9133 6.98592H17.512C17.9932 6.98592 18.1023 7.23342 17.9932 7.57533C17.7916 8.50758 15.8354 11.2704 15.8354 11.2704C15.6649 11.55 15.6026 11.6737 15.8354 11.9854C16.0059 12.2183 16.5651 12.6995 16.9382 13.134C17.6211 13.9104 18.1482 14.5622 18.2884 15.0132C18.4443 15.4623 18.2105 15.6952 17.7604 15.6952L17.7613 15.6961Z"
                        fill="white"
                      />
                    </svg>
                    <span class="visually-hidden">VK</span>
                  </a>
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </div>
    </div>
    <img class="down-footer" src="/image/svg/line-down-footer.svg" alt="фон" />
  </div>
</template>

<script>
export default {
  name: "FooterAll",
};
</script>

<style lang="scss" scoped>
*,
p,
h1,
h2,
h3,
h4,
h5,
h6 {
  margin: 0;
}

.footer {
  position: relative;
  overflow-y: hidden;

  &:before {
    content: "";
    background: url(../components/icons/footdecyello.svg) no-repeat;
    width: 140px;
    height: 199px;
    position: absolute;
    bottom: -40px;
    left: 70px;
    z-index: 3;
  }

  &:after {
    content: "";
    background: url(../components/icons/footdecwh.svg) no-repeat;
    width: 199px;
    height: 140px;
    position: absolute;
    bottom: 90px;
    right: 95px;
    z-index: 3;
  }
}

.footer-block {
  background: #8557a4;
  width: 100%;
  height: 361px;
  position: relative;
}

.wraper {
  width: 1000px;
}

.visually-hidden {
  position: absolute;
  clip: rect(0 0 0 0);
  width: 1px;
  height: 1px;
  margin: -1px;
}

.list-item {
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  list-style-type: none;
  padding-left: 0;
}

.list-link,
.list-item li {
  margin-bottom: 12px;
}

.link-item {
  font-family: "Roboto";
  font-style: normal;
  font-weight: 400;
  font-size: 16px;
  line-height: 20px;
  color: #ffffff;
  &:hover {
    opacity: 0.6;
    transition: 0.5s;
    text-decoration: none;
  }
  &:active {
    opacity: 0.2;
    transition: 0.3s;
  }
}

.text-magazin {
  font-family: "Roboto";
  font-style: normal;
  font-weight: 500;
  font-size: 18px;
  line-height: 24px;
  color: #ffffff;
}

.link-map {
  font-family: "Roboto";
  font-style: normal;
  font-weight: 500;
  font-size: 16px;
  line-height: 24px;
  color: #ffffff;
  &:hover {
    opacity: 0.6;
    transition: 0.5s;
    text-decoration: none;
  }
  &:active {
    opacity: 0.2;
    transition: 0.3s;
  }
}

.time {
  font-family: "Roboto";
  font-style: normal;
  font-weight: 300;
  font-size: 16px;
  line-height: 24px;
  color: #ffffff;
  padding-left: 16px;
}

.sinima {
  font-family: "Roboto";
  font-style: normal;
  font-weight: 300;
  font-size: 16px;
  line-height: 24px;
  color: #ffffff;
  opacity: 0.5;
  padding-left: 45px;
}

.contact {
  list-style-type: none;
  padding: 0;
  display: flex;
  flex-direction: column;
}

.contact-subscribe {
  list-style-type: none;
  padding: 0;
}

.phone {
  font-family: "Roboto";
  font-style: normal;
  font-weight: 500;
  font-size: 16px;
  line-height: 24px;
  color: #ffffff;
  padding: 0 40px 0 0;
  &:hover {
    opacity: 0.6;
    transition: 0.5s;
    text-decoration: none;
  }
  &:active {
    opacity: 0.2;
    transition: 0.3s;
  }
}

.contact-style {
  padding-left: 16px;
}

.mail {
  @extend .phone;
  &:hover {
    opacity: 0.6;
    transition: 0.5s;
    text-decoration: none;
  }
  &:active {
    opacity: 0.2;
    transition: 0.3s;
  }
}

.subscribe {
  padding: 0 40px 0 16px;
  font-family: "Roboto";
  font-style: normal;
  font-weight: 500;
  font-size: 16px;
  line-height: 24px;
  color: #ffffff;
}

.social {
  padding-right: 34px;
  &:hover {
    opacity: 0.6;
    transition: 0.5s;
    text-decoration: none;
  }
  &:active {
    opacity: 0.2;
    transition: 0.3s;
  }
}

.down-footer {
  position: absolute;
  bottom: 0;
}

@media (max-width: 360px) {
  .wraper {
    width: 360px;
    text-align: start;
    padding-right: 20px;
    display: block;
  }

  .list-link,
  .text-magazin {
    display: none;
  }

  .contact-style,
  .time {
    padding-left: 8px;
  }

  .link-map,
  .time,
  .sinima,
  .phone,
  .subscribe {
    font-size: 14px;
  }

  .sinima {
    padding-left: 36px;
  }

  .subscribe {
    padding-right: 14px;
  }

  .contact-subscribe {
    display: flex;
    flex-direction: row;
  }

  .social {
    padding-right: 14px;
  }
}
</style>
